tutorials/icoDyMFoam/mixer2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1-dev                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/hjasak/OpenFOAM/OpenFOAM-1.4.1-dev/tutorials/icoDyMFoam";
    case "mixer2D";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
impellerWall
{
    type wall;
    nFaces 68;
    startFace 1040;
}

baffleWall
{
    type wall;
    nFaces 84;
    startFace 1108;
}

insideSlider
{
    type patch;
    nFaces 36;
    startFace 1192;
}

outsideSlider
{
    type patch;
    nFaces 36;
    startFace 1228;
}

defaultFaces
{
    type empty;
    nFaces 1152;
    startFace 1264;
}
)

// ************************************************************************* //
